# Pandas Advance-1 Assignment

### Q1. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

In [ ]:
#1 Read csv file into DataFrame
df = pd.read_csv("sample.csv")

In [110]:
data= {'A': [1,2,3,4],
                      'B': [5,6,7,8],
                      'C': [9,10,11,12]}
#2 'pd.DataFrame' turn data into a DataFrame. 
df = pd.DataFrame(data) #and assign it to a variable name df
df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [111]:
# 3'head() dispaly the first few rows of a DataFrame
df.head(3) # first 3 row of the DataFrame

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11

In [112]:
#4 '.info()' provides information about the DataFrame including data types, non-null counts, and memory usage
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 224.0 bytes

In [113]:
#5 '.describe()' provides statiscal summary of numerical columns in the DataFrame.
df.describe()

              A         B          C
count  4.000000  4.000000   4.000000
mean   2.500000  6.500000  10.500000
std    1.290994  1.290994   1.290994
min    1.000000  5.000000   9.000000
25%    1.750000  5.750000   9.750000
50%    2.500000  6.500000  10.500000
75%    3.250000  7.250000  11.250000
max    4.000000  8.000000  12.000000

### Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [30]:
q2_df = pd.DataFrame({'A': [1,2,3,4],
                      'B': [5,6,7,8],
                      'C': [9,10,11,12]})

In [31]:
q2_df

   A  B   C
0  1  5   9
1  2  6  10
2  3  7  11
3  4  8  12

In [45]:
def re_index(df):
    index = list(range(1, len(q2_df)*2, 2))
    df['index'] = index
    df.set_index('index', inplace=True)
    return df

In [46]:
re_index(q2_df)

       A  B   C
index
1      1  5   9
3      2  6  10
5      3  7  11
7      4  8  12

### Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

**For example**, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

In [47]:
q3_df = pd.DataFrame({'Values':[10, 20, 30, 40, 50]})
q3_df

   Values
0      10
1      20
2      30
3      40
4      50

In [48]:
q3_df.rolling(window=3).sum()

   Values
0     NaN
1     NaN
2    60.0
3    90.0
4   120.0

### Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [52]:
q4_df = pd.DataFrame({'Text': 'Given a Pandas DataFrame df with a column'}, index=[0])
q4_df

                                        Text
0  Given a Pandas DataFrame df with a column

In [68]:
q4_df['Text']

0    Given a Pandas DataFrame df with a column
Name: Text, dtype: object

In [69]:
q4_df['Word_Count'] = q4_df['Text'].apply(lambda x: len(x.split()))
q4_df

                                        Text  Word_Count
0  Given a Pandas DataFrame df with a column           8

### Q5. How are DataFrame.size() and DataFrame.shape() different?

 #### DataFrame.sinze() returns the total number of elements in the DataFrame while DataFrame.shape() returns the a tuple that represets the dimensions of the DataFrame.

### Q6. Which function of pandas do we use to read an excel file?

#### We use the 'pd.read_excel()' function to read an excel file.

### Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

### The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [71]:
q7_df = pd.DataFrame({'Email': ['username@domain.com', 'john.doe@example.com']})
q7_df

                  Email
0   username@domain.com
1  john.doe@example.com

In [73]:
q7_df['Username'] = q7_df['Email'].apply(lambda x: x.split('@')[0])
q7_df

                  Email  Username
0   username@domain.com  username
1  john.doe@example.com  john.doe

### Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

**For example**, if df contains the following values:

   A   B   C

0  3   5   1

1  8   2   7

2  6   9   4

3  2   3   5

4  9   1   2

Assignment
Data Science Masters
Your function should select the following rows:   A   B   C

1  8   2   7

4  9   1   2

The function should return a new DataFrame that contains only the selected rows.

In [74]:
q8 = {'A' : [3,8,6,2,9],
      'B' : [5,2,9,3,1],
      'C':  [1,7,4,5,2]}
q8_df = pd.DataFrame(q8)
q8_df

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [82]:
q8_df[(q8_df['A'] > 5) & (q8_df['B'] < 10)]

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [83]:
def select_rows(df):
    return df[(df['A'] > 5) & (df['B'] < 10)]

In [84]:
select_rows(q8_df)

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [86]:
q9_df = pd.DataFrame({'Values':[10, 20, 30, 40, 50]})
q9_df

   Values
0      10
1      20
2      30
3      40
4      50

In [87]:
q9_df['Values'].mean()

30.0

In [88]:
q9_df['Values'].median()

30.0

In [89]:
q9_df['Values'].std()

15.811388300841896

### Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [90]:
def calculate_moving_average(df, days=7):
    df.sort_values(by='Date')
    df['Moving Average'] = df['Sales'].rolling(window=days, min_periods=1).mean()
    return df

### Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:

         Date

0  2023-01-01

1  2023-01-02

2  2023-01-03

3  2023-01-04

4  2023-01-05

Your function should create the following DataFrame:


         Date    Weekday

0  2023-01-01    Sunday

1  2023-01-02     Monday

2  2023-01-03    Tuesday

3  2023-01-04    Wednesday

4  2023-01-05    Thursday

The function should return the modified DataFrame.

Note:  Create your assignment in Jupyter notebook and upload it in GitHub & share that github repository link through your dashboard. Make sure the repository is public.

Assignment
Data Science Masters

In [91]:
q11 = {'Date': ['2023-01-01', '2023-01-02', '2023-01-03', '2023-01-04', '2023-01-05']}
q11_df = pd.DataFrame(q11)
q11_df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05

In [96]:
def add_weekday_column(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df['Weekday'] = df['Date'].dt.strftime('%A')
    return df

In [97]:
add_weekday_column(q11_df)

        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

### Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [103]:
q12 = {'Date': pd.date_range('2023-01-01', '2023-03-31')}
q12_df = pd.DataFrame(q12)
q12_df

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
..        ...
85 2023-03-27
86 2023-03-28
87 2023-03-29
88 2023-03-30
89 2023-03-31

[90 rows x 1 columns]

In [108]:
def date_range_rows(df, column_name='Date',start_date='2023-01-01', end_date='2023-01-31'):
    df[column_name] = pd.to_datetime(df[column_name])
    query = (df['Date'] >= start_date) & (df['Date'] <= end_date)
    selected_rows = df[query]
    return selected_rows

In [109]:
date_range_rows(q12_df,start_date='2023-01-01', end_date='2023-01-31')

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
5  2023-01-06
6  2023-01-07
7  2023-01-08
8  2023-01-09
9  2023-01-10
10 2023-01-11
11 2023-01-12
12 2023-01-13
13 2023-01-14
14 2023-01-15
15 2023-01-16
16 2023-01-17
17 2023-01-18
18 2023-01-19
19 2023-01-20
20 2023-01-21
21 2023-01-22
22 2023-01-23
23 2023-01-24
24 2023-01-25
25 2023-01-26
26 2023-01-27
27 2023-01-28
28 2023-01-29
29 2023-01-30
30 2023-01-31

### Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported

#### You need to import 'pandas' library first in order to use the basic functions of pandas